In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
dict1 ={
    "name":['rohit','pramuck','rohan','ravi'],
    "city":['bangalore','bangalore','upradesh','bhendwad'],
    "marks":['95','96','97','100']
}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

      name       city marks
0    rohit  bangalore    95
1  pramuck  bangalore    96
2    rohan   upradesh    97
3     ravi   bhendwad   100

In [6]:
df.to_csv('rohit.csv')

In [7]:
df.describe()

         name       city marks
count       4          4     4
unique      4          3     4
top     rohit  bangalore    95
freq        1          2     1

In [8]:
prk = pd.read_csv('prk.csv')

In [9]:
prk

   Unnamed: 0       name  marks       city
0           0      rohit     92    belgavi
1           1      rohan     92   upradesh
2           2    pramuck     95  bangalore
3           3  bajarangi    100  anjanadri

In [10]:
prk['city']

0      belgavi
1     upradesh
2    bangalore
3    anjanadri
Name: city, dtype: object

In [12]:
prk.tail(2)

   Unnamed: 0       name  marks       city
2           2    pramuck     95  bangalore
3           3  bajarangi    100  anjanadri